Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་དག་ས་ཕྱོགས་གང་དུ་འདུག་སྟེ། ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མངོན་པར་འཕགས་པའི་རྒྱལ་པོ་དེ་ལ་ཚིགས་སུ་བཅད་པའི་གླུའི་དབྱངས་ཀྱིས་བསྟོད་པའི་ས་ཕྱོགས་དེར་ཙན་དན་དམར་པོ་ལས་བྱས་པའི་དེ་བཞིན་གཤེགས་པའི་གཙུག་ལག་ཁང་རྒྱར་དཔག་ཚད་བཞི། འཕང་དུ་དཔག་ཚད་ཕྱེད་པ་བྱས་ཏེ དེ་དག་གིས་གཙུག་ལག་ཁང་དེ་བྱས་ནས་དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་ལོ། ། ཕུལ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མངོན་པར་འཕགས་པའི་རྒྱལ་པོ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །
en: “On the very spot where these sweet-sounding verses were sung to the Lord, the king Abhyudgata, the tathāgata, the arhat, the fully accomplished Buddha, they had a red sandalwood monastery built for the Tathāgata, four yojanas wide and half a yojana tall. They offered this monastery to the Tathāgata and then spoke these verses to the Lord Tathāgata, the king Abhyudgata:

source: གནས་པ་གང་ལ་ཁྱོད་ནི་བཞུགས་གྱུར་པས། །སྔོན་གྱི་རྒྱལ་བས་བཞི་པོ་གང་བསྔགས་པ། །གནས་པ་དེ་ནི་བཙལ་བར་བགྱི་བའི་ཕྱིར། །གཙུག་ལག་ཁང་འདི་བདེ་བར་གཤེགས་ལ་འབུལ།
en: “ ‘This place where you have come to stay Was praised by four different victorious ones in the past. We wish to establish a monastery here, And so we offer this monastery to the Sugata.

source: །གནས་པ་དག་ནི་གང་ལ་རྟག་བཞུགས་ན འདས་དང་མ་འོངས་ད་ལྟར་བྱུང་བ་ཡི། །སེམས་ནི་སྲོག་ཆགས་བྱེ་བས་མི་འཚལ་བའི། །སྤྱོད་པ་དེ་ནི་བདག་གིས་བཙལ་བར་བགྱི། །
en: “ ‘May this always be a place where the millions of beings Who lack an understanding of the mind can stay, In the past, the present, and the future. This is what we want this monastery to be.

source: སྤྱོད་པ་གང་དག་ཕ་རོལ་སོན་པ་ནི། །ཡང་དག་སྤོང་དང་དེ་བཞིན་རྫུ་འཕྲུལ་རྐང་། །མཆོག་བཞི་རྣམས་ཀྱི་སོ་སོར་ཡང་དག་རིག །སྤྱོད་པ་དེ་དག་བདག་གིས་བཙལ་བར་བགྱི། །
en: “ ‘The actions that you have perfected—True renunciation, the foundations of magical abilities, The four excellent things, and analytical abilities—This is what we want this monastery to be dedicated to.’

source: དེ་དག་གིས་གཙུག་ལག་ཁང་དེ་ཉིད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མངོན་པར་འཕགས་པའི་རྒྱལ་པོ་དེ་དེ་དང་། དགེ་སློང་གི་དགེ་འདུན་དུ་བཅས་པ་ལ་ཟླ་བ་ཕྱེད་ཀྱི་བར་དུ་བསྟི་སྟང་དུ་བྱེད། བླ་མར་བྱེད། རི་མོར་བྱེད། མཆོད་པར་བྱེད་དེ། དེ་དག་གིས་གཙུག་ལག་ཁང་དེར་དེ་བཞིན་གཤེགས་པ་དགེ་སློང་གི་དགེ་འདུན་དུ་བཅས་པ་ལ་བསྟི་སྟང་དུ་བྱས། བླ་མར་བྱས། རི་མོར་བྱས། མཆོད་པ་བྱས་ནས། དེ་བཞིན་གཤེགས་པ་དེ་ཉིད་ཀྱི་དྲུང་དུ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་གོས་ངུར་སྨྲིག་བགོས་ཏེ། དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ནས་དགེ་བའི་ཆོས་ཚོལ་བ་ལ་བརྩོན་པར་གྱུར་ཏེ། དགེ་བའི་ཆོས་ཚོལ་བ་ལ་ཡིད་བརྩོན་པར་གྱུར་ཏོ། །
en: “They then honored, revered, praised, and worshiped the Lord Tathāgata, the king Abhyudgata, and his community of mendicants in that very monastery for two weeks. After they had honored, revered, praised, and worshiped the Tathāgata and his community of mendicants in that monastery, they had their hair and beards shaved, donned saffron robes, and, following their conviction, left ordinary household life behind and became renunciants searching untiringly for the wholesome Dharma.

source: དེ་ནས་གཅིག་གིས་སྨྲས་པ། འཇིག་རྟེན་མགོན་པོ་འོད་བྱེད་པར། །བདག་ནི་དང་པོར་སྔར་གྱུར་ཅིག །
en: “One of them said, ‘I will be the first to become an illustrious protector of the world.’

source: ཅིག་ཤོས་ཀྱིས་སྨྲས་པ། དེད་དཔོན་མི་ཡི་གཙོ་བོར་ཡང་། །བདག་ནི་དང་པོར་སྔར་གྱུར་ཅིག །
en: “Another said, ‘I will be the first to become a caravan leader, supreme among men.’

source: དེ་ན་ཤཱ་རིའི་བུ་གང་སྡོམ་པ་ཞེས་བྱ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མངོན་པར་འཕགས་པའི་རྒྱལ་པོ་དེའི་སྤྱན་སྔར་འདུག་ནས་ཡིད་མ་བཅས་པ།
en: “Then, Śāriputra, the bodhisatva, the great being called Samvara, stood in front of the Lord Tathāgata, the king Abhyudgata, and made this vow:

source: སྟན་དག་ལ་ཡང་མི་འདུག་ཅིང་། །བདག་ནི་མལ་དུ་མི་ཉལ་ལོ། །
en: “ ‘I will not rest on seats, And I will not sleep in beds.

source: སྲོག་ཆགས་རྣམས་ཀྱི་དོན་འཚལ་ཕྱིར། །བདག་གིས་བྱང་ཆུབ་ལམ་བཙལ་ལོ། །
en: I will search for the path to awakening For the sake of living beings.

source: བདག་ཉིད་ཀྱི་ཡང་ལུས་དང་ནི། །སྲོག་ཀྱང་ཡོངས་སུ་སྤངས་བགྱིས་ཏེ། །ལེ་ལོ་དག་ནི་ཀུན་སྤངས་ནས། །བྱང་ཆུབ་དམ་པ་བཙལ་བར་བགྱི། །
en: “ ‘I will readily give up My body and my life And put laziness aside In my search for supreme awakening.

source: ཤ་རྣམས་དང་ནི་དེ་བཞིན་ཁྲག་རྣམས་དང་། །པགས་པ་དང་ནི་རྒྱུས་སྐམས་སྲོག་བོར་ཏེ། །
en: “ ‘I will let my flesh, as well as my blood, Skin, and sinews, dry up.

source: ལེ་ལོ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་བགྱིས་ནས། །བྱང་ཆུབ་མཆོག་ཕྱིར་བརྩོན་འགྲུས་བརྩམ་པར་བགྱི། །
en: I will ignore my health, And abandoning all forms of laziness, I will vigorously strive for the highest awakening.’

source: ཤཱ་རིའི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྡོམ་པ་ལ་གནས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྡོམ་པ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Then, Śāriputra, the bodhisatva, the great being Samvarasthita, spoke these verses to the bodhisatva, the great being Samvara:

source: བདག་ཅག་གཉིས་ནི་འདུས་གྱུར་ནས། །སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །བྱང་ཆུབ་སྤྱོད་པ་རྣམས་སྤྱད་ཅིང་། །བརྩོན་འགྲུས་དམ་པ་བརྩམ་པར་བྱ། །
en: “ ‘The two of us, having studied together, Will practice the way to awakening And apply ourselves with supreme vigor For the benefit of all living beings.

source: ལུས་རྣམས་དང་ནི་དེ་བཞིན་སྲོག་བོར་ཏེ། །
en: “ ‘Giving up our bodies as well as our lives,

source: ཤ་དང་ཁྲག་ནི་རྟག་ཏུ་སྐམས་གྱུར་ཀྱང་། །སྲིད་པ་སྟོང་དུ་ཁྱོད་ཀྱི་རྗེས་སློབ་ཅིང་། །བྱང་ཆུབ་མཆོག་ཕྱིར་བརྩོན་འགྲུས་བརྩམ་པར་བྱ། །
en: And even letting our flesh and blood dry up, In the same way you have trained for a thousand lifetimes, We will vigorously strive for the highest awakening.

source: གང་དུ་ཆོས་ཀྱི་བདག་པོ་བཞུགས་མཛེས་པའི། །ཡེ་ཤེས་དམ་པ་ཡོངས་སུ་བཙལ་བྱ་ཞིང་། །དགོན་པའི་གནས་ཀྱི་རི་དང་ཆུ་དྲུང་དུ། །ཐེ་ཚོམ་མེད་པར་བརྩོན་འགྲུས་བརྩམ་བྱ། །
en: “ ‘Dwelling free from doubt in the forest, Applying ourselves with vigor in mountains and ravines, We will search for the highest form of knowledge Where the wonderful Lord of Dharma dwells.’

source: ཤཱ་རིའི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྡོམ་པ་དང་། སྡོམ་པ་ལ་གནས་པ་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་ཐ་ན་སེ་གོལ་གཏོགས་པ་སྲིད་དུ་ཡང་རྨུགས་པ་དང་གཉིད་ཀྱིས་ནོན་པར་མ་གྱུར་ཏོ། ། ལོ་སྟོང་དུ་ལན་འགའ་ཡང་ཉལ་ལོ་སྙམ་དུ་ཉལ་བའི་སེམས་མ་བསྐྱེད་དོ། ། ལོ་སྟོང་དུ་ལན་འགའ་ཡང་འདུག་གོ་སྙམ་དུ་སྟན་འདོད་པར་མ་གྱུར་ཏོ། ། དེ་གཉིས་བཤད་པ་དང་། གཅི་བའི་ཚེ་མ་གཏོགས་པར་ལོ་སྟོང་དུ་ཐ་ན་ལན་འགའ་ཡང་ཙོག་ཙོག་པོར་མ་འདུག་གོ ། ནམ་ཁ་ཟས་ཟ་བ་ན་ཡང་འགྲེང་བཞིན་དུ་ཁམས་གསུམ་གསུམ་ཙམ་ཟ་ཞིང་ཆུ་ཕོར་གང་ཙམ་འཐུང་ངོ་། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་ཁ་ཟས་འདོད་པའམ། བཀྲེས་ན་མྱུར་དུ་ཁ་ཟས་རྙེད་པར་དགའ་བ་མ་བསྐྱེད་དོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་ཁ་ཟས་དེ་ལས་ལྷག་པར་མ་ཟོས་སོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ཁ་ཟས་ཟ་བ་ན་ལན་འགའ་ཡང་ཁ་ཟས་ལ་མངར་བ་དང་། སྐྱུར་བ་དང་། བྲོ་བ་དང་། ཚ་བ་དང་། ཁ་བ་དང་། བསྐ་བར་ཐ་ན་སེམས་བསྐྱེད་པ་གཅིག་ཙམ་ཡང་འདུ་ཤེས་མ་བསྐྱེད་དོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་བསོད་སྙོམས་བསྒྲུབ་པ་ལ་ངེད་ལ་བསོད་སྙོམས་སྦྱིན་པ་འདི་བུད་མེད་མ། སྐྱེས་པའམ། ཁྱེའུ་འམ། བུ་མོའམ། སུ་ཞིག་ཅེས་ལན་འགའ་ཡང་གདོང་དུ་མ་བལྟས་སོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ཤིང་གང་གི་དྲུང་ན་གནས་པ་ཤིང་དེ་ལ་གྱེན་དུ་ལན་འགའ་ཡང་མ་བལྟས་སོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་ཆོས་གོས་གཉིས་སུ་མ་བརྗེས་སོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་ཐ་ན་སེམས་བསྐྱེད་པ་གཅིག་ཀྱང་འདོད་པའི་རྣམ་པར་རྟོག་པ་མ་བརྟགས། གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་མ་བརྟགས། འཚེ་བའི་རྣམ་པར་རྟོག་པ་མ་བརྟགས་སོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་ཐ་ན་སེམས་བསྐྱེད་པ་གཅིག་ཀྱང་ཟླ་བ་ལ་སོང་བའམ། ཉི་མ་ལ་སོང་བའམ། ཕ་ལ་སོང་བ་འམ། མ་ལ་སོང་བའམ། སྤུན་ལ་སོང་བའམ། སྲིང་མོ་ལ་སོང་བའམ། ཉེ་དུ་ལ་སོང་བའི་རྣམ་པར་རྟོག་པ་མ་བསྐྱེད་དོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་འདས་ཀྱི་བར་དུ་ལན་འགའ་ཡང་ཐ་ན་སེམས་བསྐྱེད་པ་གཅིག་ཀྱང་ཁྱིམ་ལ་གནས་པའི་རྣམ་པར་རྟོག་པ་མ་བརྟགས་སོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་ཟླ་བའམ། ཉི་མ་འམ། སྐར་མའི་གཟུགས་སམ། བར་སྣང་ལ་གྱེན་དུ་མ་བལྟས་སོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་རྩིག་པའམ། ཤིང་ལ་མ་བསྙེས་སོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་མར་རམ། འབྲུ་མར་གྱིས་ལུས་མ་བསྐུས་སོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་ཐ་ན་སེམས་བསྐྱེད་པ་གཅིག་ཀྱང་མར་དང་ལྡན་པའི་སེམས་མ་བསྐྱེད་དོ། ། དེ་གཉིས་ཀྱིས་ལན་འགའ་ཡང་ཐ་ན་སེམས་བསྐྱེད་པ་གཅིག་ཀྱང་ལུས་ལ་སྐྱོ་བ་མ་བསྐྱེད་དོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་ཐ་ན་སེམས་བསྐྱེད་པ་གཅིག་ཀྱང་བདག་ཅག་གིས་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་ཤེས་ལུས་ངལ་བ་མ་བསྐྱེད་དོ། ། དེ་གཉིས་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་ལུས་ན་བའམ། སེམས་ན་བར་མ་གྱུར་ཏོ། ། དེ་དག་གིས་ལོ་སྟོང་འདས་ཀྱི་བར་དུ་ནམ་ཡང་སྐྲ་བྲེག་པར་སེམས་མ་བསྐྱེད་དོ། ། གཞན་དུ་ན་རྒྱལ་པོ་ཆེན་པོ་བཞི་འོངས་ནས་མགོ་ལ་བྱུགས་ཏེ་སྐྲ་ཁྱེར་ནས་ཕྱིར་འདོང་ངོ་། ། དེ་དག་སྐྲ་ཁྱེར་ནས་མཆོད་རྟེན་བཙུགས་སོ། ། དེ་དག་གིས་ལོ་སྟོང་གི་བར་དུ་རྒྱལ་པོ་ཆེན་པོ་དེ་དག་འོངས་པ་དང་། སོང་བ་ལ་ནམ་ཡང་འོང་བ་དང་། འགྲོ་བའི་སེམས་མ་བསྐྱེད་དོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་གྲིབ་མ་བབ་པ་ན་ཉི་མ་དང་། ཉི་མས་ཕོག་ན་གྲིབ་མའི་སེམས་མ་བསྐྱེད་དོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་གྲང་བའི་དུས་ན་ཡང་ལན་འགའ་ཡང་ལུས་ལ་གཡོག་པའི་འདུ་ཤེས་མ་བསྐྱེད་དོ། ། དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་ལན་འགའ་ཡང་འཇིག་རྟེན་གྱི་ཚིག་མ་སྨྲས་སོ། ། ཡང་ཤཱ་རིའི་བུ་དེའི་དུས་ན་དྲན་པ་རྨོངས་བྱེད་ཅེས་བྱ་བའི་བདུད་ཅིག་བྱུང་སྟེ། འདི་ལྟ་སྟེ། དཔེར་ན་ད་ལྟར་གྱི་ངའི་བདུད་སྡིག་ཅན་བཞིན་ནོ། །
en: “And so, Śāriputra, for a thousand years the bodhisatvas Samvara and Samvarasthita were not overcome by sloth or indolence, even for a moment as brief as a snap of one’s fingers. Never in a thousand years did they feel inclined to rest, thinking, ‘Let’s sleep.’ Never in a thousand years did they wish to lie down, thinking, ‘Let’s relax.’ Never in a thousand years did they squat, except for when they had to urinate or defecate. They would eat and drink standing up, eating only three morsels of food and drinking only from the water bowl. Never in a thousand years did they have any longing for food, nor would they try to acquire food quickly when they were hungry. Never in a thousand years did they eat to excess. Never in a thousand years did they think that the food they were consuming was too sweet, too sour, too salty, too pungent, too bitter, or too astringent, even for a single moment. Never in a thousand years did they pay attention to the appearance of the person they were receiving offerings from, thinking, ‘Who is giving us these offerings? Is it a woman, a man, a boy, or a girl?’ Never in a thousand years did they look up at that tree they were sitting under. Never in a thousand years did they change into a second set of robes. Never in a thousand years did any thought of desire, of malice, or of harming others occur to them, even for a single moment. Never in a thousand years did their thoughts stray toward the moon or the sun, their mother or their father, their brothers, their sisters, or their relatives, even for a single moment. Never in a thousand years did they have any inclination at all to live in a house, even for a single moment. Never in a thousand years did they glance up at the moon, the sun, or the stars above. Never in a thousand years did they rely upon clay or wood. Never in a thousand years did they apply butter or oil to their bodies. Never in a thousand years did they have any thought for the delicacy of butter, even for a single moment. Never in a thousand years did they grow weary, even for a single moment. Never in a thousand years did they become discouraged, thinking, ‘We will never be able to attain unsurpassed perfect awakening,’ even for a single moment. Never in a thousand years did they become physically or mentally ill. Never in a thousand years did it occur to them that they should cut their hair. When the Four Great Kings appeared, they anointed their heads and took the hair with them, and with the hair they took they inaugurated a stūpa. Never in a thousand years did the two of them wonder about the appearance of the Great Kings, and whether they would come again in the future. Never in a thousand years did they wish for shade from the scorching sun, or for the sun when it was cloudy. Never in a thousand years were they concerned about covering their bodies during the cold season. Never in a thousand years did they ever say anything of a worldly nature.

source: ཤཱ་རིའི་བུ་བདུད་དྲན་པ་རྨོངས་བྱེད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྡོམ་པའི་འཆག་སར་རལ་གྲིའི་སོ་གཏམས་པ་བྱས་པར་གྱུར་པ་དང་། དེས་རལ་གྲིའི་སོ་དེ་ལ་རལ་གྲིའི་སོར་འདུ་ཤེས་བསྐྱེད་ནས་ དེས་བདག་ནི་བག་མེད་པ་ལ་གནས་སོ། ། བདག་ནི་བག་མེད་པ་ལ་གནས་སོ་ཞེས་སྒྲ་ཕྱུང་བ་དང་། སྒྲ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དབྱངས་ཀྱིས་གོ་བར་གྱུར་ཏོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དབྱངས་ཀྱིས་གོ་བར་བྱས་པ་དང་། དེ་ནས་སྟེང་གི་བར་སྣང་ལས་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གིས་ཀྱེ་མའོ། ། བྱང་ཆུབ་སེམས་དཔའ་ཤི་འཕོས་སུ་མ་གྱུར་ཏོ། ། ཤི་འཕོས་སུ་མ་གྱུར་ཏོ། ། ཞེས་སྒྲ་ཕྱུང་ངོ་། ། ཤཱ་རིའི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྡོམ་པ་དེ་ལྟར་འཆག་པས་སེམས་བསྐྱེད་པ་དེའི་རྗེས་སུ་ཞུགས་ཏེ། ཡང་ཤཱ་རིའི་བུ་ལྷ་དང་བཅས་པའི་སྒྲ་གཉིས་པ་ཕྱུང་བ་དེ་བྱང་ཆུབ་སེམས་དཔའ་སྡོམ་པས་མ་ཐོས་སོ། ། གང་ལྷའི་སྒྲ་དང་། གང་སྡོམ་པའི་སྒྲ་དེ་གཉིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སྡོམ་པ་ལ་གནས་པས་མ་ཐོས་ཏེ་
en: “Śāriputra, a time came when the māra named Saṃmūḍhasmṛti appeared to them, in the same way evil māras have appeared to me in this life. Śāriputra, the māra Saṃmūḍhasmṛti transformed the path upon which the bodhisatva Samvara was treading into the edges of swords, and as he became aware of the presence of these sword edges, he uttered the words, ‘I am negligent as I go. I am negligent as I go.’ These words reverberated throughout the threefold thousand great thousand worlds. At that, a host of a billion mārakāyika gods appeared in the sky with the words, ‘Oh, this bodhisatva cannot perish. He cannot perish.’ Then, Śāriputra, the bodhisatva Samvara went on his way with his commitment unbroken. The mārakāyika gods, Śāriputra, spoke a second time, but the bodhisatva Samvara did not pay attention to what they said. The bodhisatva Samvarasthita heard neither the words of the mārakāyika gods nor the words of Samvara.

source: ཤཱ་རིའི་བུ་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་སྤྱོད་ལམ་དེ་ལྟ་བུ་དང་། སྤྱོད་པ་དེ་ལྟ་བུ་དང་། ནན་ཏན་དེ་ལྟ་བུ་དང་། །སྙིང་རྗེ་ཆེན་པོ་དེ་ལྟ་བུ་དང་། རྟུལ་བ་དེ་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ཏེ དེ་གཉིས་ཀྱིས་ལོ་སྟོང་དུ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམས་སོ། །
en: “Śāriputra, this was the sort of spiritual practice, the sort of conduct, the sort of development, the sort of great compassion, and the sort of application that these two noble individuals possessed, and for a thousand years they cultivated the recollection of awakening.

source: གང་གི་ཚེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མངོན་པར་འཕགས་པའི་རྒྱལ་པོ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དང་། དེ་ནས་ལྷ་ཞིག་འོངས་ནས་ རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ་ཞེས་སྦྲན་ཏེ། དེ་གཉིས་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ་ཞེས་ཐོས་ནས་བཅོམ་ལྡན་འདས་དེའི་ཁྲི་གང་ན་ཡོད་པ་དེར་སོང་སྟེ། འགྲེང་བཞིན་དུ་ཐལ་མོ་སྦྱར་ནས་ཉི་མ་བདུན་གྱི་བར་དུ་མིག་མི་འཛུམས་པར་ལྟ་སྟེ། བྱམས་པ་དང་ལྡན་ཞིང་འགྲན་ཟླ་མེད་པས་གུས་པས་རྗེས་སུ་དྲན་པར་བྱས་ཏེ། དེ་དག་གིས་བརྩོན་འགྲུས་མ་བཏང་བས་འགྲེང་བཞིན་དུ་འཆི་བའི་དུས་བྱས་སོ། ། དེ་དག་དེ་ནས་ཤི་འཕོས་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། ། དེ་གཉིས་ཚངས་པར་གྱུར་ནས་སླར་ལོག་སྟེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེའི་མཆོད་རྟེན་བྱས་ནས་ལོ་བཞི་ཁྲིའི་བར་དུ་མཆོད་རྟེན་གྱི་ཡོ་བྱད་ཀྱི་ལས་བྱས་སོ། ། དེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་གྱི་གདུགས་བཙུགས་ཟིན་པར་ཤེས་ནས་ ལོ་བདུན་ཁྲིའི་བར་དུ་འགྲེང་བཞིན་དུ་ཐལ་མོ་སྦྱར་ཏེ་ གནས་ནས་ དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་དེ་ལ་ཕྱག་བྱེད་དོ། ། དེ་དག་ཚེའི་མཐར་ཕྱིན་ཏེ་ཤི་འཕོས་ནས་ཡང་འཛམ་བུའི་གླིང་ཉིད་དུ་སྐྱེས་ཏེ། འཁོར་ལོས་སྒྱུར་བའི་རིགས་སུ་མའི་མངལ་དུ་མཚེ་མར་སྐྱེས་སོ། ། དེ་གཉིས་སྐྱེས་མ་ཐག་ཏུ་གཅིག་གིས་གཅིག་དྲན་ནས་བདག་ཅག་བག་ཡོད་པ་ལ་གནས་པར་བྱའོ། ། བདག་ཅག་བག་ཡོད་པའི་མཆོག་བསྒོམ་པར་བྱའོ་ཞེས་སྨྲས་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Then, when the Lord Tathāgata, the king Abhyudgata, passed away, they were approached by a god who said to them, ‘Sons of good family, the Tathāgata has passed away.’ When they heard of the Tathāgata’s passing, they went to the place where the Lord had died, and standing upright, they joined their palms and watched for seven days without blinking, filled with love. They recollected that he was unmatched and worthy of respect. They remained standing without becoming dejected until the time of their own deaths arrived, and then they went to the brahmā world. When they returned, they built a stūpa for the tathāgata, the arhat, the fully accomplished Buddha, and they looked after it and maintained it for forty thousand years. Seeing that the Tathāgata’s stūpa was covered with parasols, they remained standing with their palms joined for seventy thousand years, honoring the Tathāgata’s stūpa. When their lives were over and they passed away, they were again reborn on the Jambu continent to a king of the entire world, conceived as twins in their mother’s womb. When they were born, they recognized each other instantly and reiterated their commitment to continue their training in attentiveness: ‘We will train in the supreme form of attentive presence.’ “They spoke these verses:

source: འབྱོར་དང་རྒྱས་ཤིང་རྟག་ཏུ་ལོ་ལེགས་པའི། །ཡིད་འོང་རྒྱལ་པོའི་རིགས་སུ་བདག་ཅག་སྐྱེས། །
en: “ ‘We were born into a pleasant state of existence as royalty, Prosperous, thriving, and with unlimited access to resources,

source: བག་མེད་རྒྱགས་པ་རབ་ཏུ་སྤང་བྱ་སྟེ། །
en: But we will leave drunken vanity behind

source: བྱང་ཆུབ་དམ་པ་རབ་ཏུ་བསྒྲུབ་པར་བྱ། །
en: And work toward the highest awakening.

source: འདོད་དང་ལོངས་སྤྱོད་དེ་བཞིན་རྒྱལ་པོའི་སྲིད། ། ཡིད་བརྟན་མི་རུང་རིང་པོར་མི་ཐོགས་ཏེ། ། བྱང་ཆུབ་དམ་པ་ཡོངས་སུ་ཚོལ་བ་ན། །མཁས་པ་དེ་ལ་འདོད་པ་མི་སྐྱེད་དོ། །
en: “ ‘The pleasure of the senses, possessions, and royalty Cannot be trusted. They are fleeting. They do not last. They are not what the wise, Those who search for the highest awakening, wish for.

source: སྲོག་ཆགས་ཕན་ཕྱིར་བྱང་ཆུབ་གང་ཞུགས་པ། །འདོད་དང་ལོངས་སྤྱོད་ལ་ནི་འདོད་མི་སྐྱེད། །
en: “ ‘The wise do not long for the pleasures of the senses and possessions. They approach awakening for the sake of all living beings.

source: མྱུར་དུ་འདོད་པ་སྤངས་ཤིང་རབ་བྱུང་ནས། ། ཚངས་པར་སྤྱོད་པ་དམ་པ་མཆོག་སྤྱད་དོ། །
en: Abandoning their desires and quickly becoming renunciants, They live the excellent life of purity.

source: སྔོན་འདས་དུས་ནི་ཤིན་ཏུ་རྒྱས་པ་ནས། ། ལྷ་རྫས་དག་དང་མི་ཡི་བཟང་པོ་དང་། །འདོད་པའི་ཡོན་ཏན་ལྔ་དག་བསྟེན་གྱུར་ཀྱང་། །དེ་ལ་ནམ་ཡང་ངོམས་པ་མ་རྙེད་དོ། །
en: “ ‘The pleasures of the five senses have been dominant Throughout time, for a vast amount of time, But gods and human beings can never be satisfied, No matter how much of it they obtain.

source: དེ་ཕྱིར་རྒྱལ་སྲིད་རྒྱས་དང་གཉེན་ཚོགས་དང་། །འདོད་པའི་ཡོན་ཏན་འདི་དག་སྤང་བྱ་སྟེ། །
en: “ ‘Therefore, we will put the pleasures of the senses aside, Along with possessions, royalty, affluence, and even our relatives.

source: ལུས་སྐྱེས་ནས་ནི་མྱུར་དུ་རབ་བྱུང་ལ། །བྱང་ཆུབ་ཕྱིར་ནི་བརྩོན་འགྲུས་བརྩམ་པར་བྱ། །
en: Growing up, we will quickly become renunciants And vigorously engage with the causes of awakening.’

source: དེ་གཉིས་སྐྱེས་ནས་ལོ་བཅུ་དྲུག་ལོན་པ་དང་འདྲ་བར་གྱུར་ནས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་སྟེ། ལོ་ཉི་ཁྲིའི་བར་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ། ། དེ་ནས་ཤི་འཕོས་ནས་སླར་ཡང་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། ། ཚངས་པའི་འཇིག་རྟེན་ནས་ཤི་འཕོས་ནས་སླར་ཡང་འཛམ་བུའི་གླིང་དུ་སྐྱེས་སོ། །
en: “After they had been born, at the age of about sixteen, they had their hair shaved off, donned saffron robes, and, following their conviction, renounced ordinary household life and became renunciants, going on to live the life of purity for twenty thousand years. When they passed away, they were reborn in the brahmā world, and when they passed away from the brahmā world they were reborn once again on the Jambu continent.

source: ཡང་ཤཱ་རིའི་བུ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དྲི་མཆོག་ཅེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། །སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་ མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ དེ་བཞིན་གཤེགས་པ་དེ་དེ་གཉིས་ཀྱིས་མཉེས་པར་བྱས་ཏེ། དེ་གཉིས་དེ་བཞིན་གཤེགས་པ་དེའི་དྲུང་དུ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་གོས་ངུར་སྨྲིག་བགོས་ཏེ། དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་། ། དེ་གཉིས་རབ་ཏུ་བྱུང་ནས་ལོ་བྱེ་བ་ཚང་བར་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ། །
en: “At that time, Śāriputra, a tathāgata, arhat, fully accomplished buddha by the name of Varagandha appeared in the world. He was perfect in wisdom and conduct, and he was a sugata, a knower of the world, an unsurpassable guide for those who wished to train, a teacher of gods and men, awakened, a lord. The two of them served the Tathāgata, and in the Tathāgata’s presence they had their hair shaved off, donned saffron robes, and, following their conviction, renounced ordinary household life and became renunciants. As renunciants they lived the life of purity for ten million years.

source: ཤཱ་རིའི་བུ་རྣམ་གྲངས་དེས་སངས་རྒྱས་ཁྲི་མཉེས་པར་བྱས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སྡོམ་པས་ཐམས་ཅད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ། ། བྱང་ཆུབ་སེམས་དཔའ་སྡོམ་པ་ལ་གནས་པས་ནི་དེ་བཞིན་གཤེགས་པ་གཅིག་གི་དྲུང་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ། །
en: “In this way, Śāriputra, serving ten thousand buddhas, the bodhisatva Samvara always lived the life of purity. The bodhisatva Samvarasthita lived the life of purity in the presence of a single buddha.

source: དེ་ལ་ཤཱ་རིའི་བུ་གང་བྱང་ཆུབ་སེམས་དཔའ་སྡོམ་པ་ཞེས་བྱ་བ་དེ་སྔར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བརྩོན་འགྲུས་འབར་བ་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་ མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ དེ་ལོ་བྱེ་བ་ཕྲག་དགུ་བཅུའི་བར་དུ་གནས་སོ། ། དེའི་ཉན་ཐོས་ཀྱང་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུའི་ཉན་ཐོས་ཀྱི་འདུས་པ་ཆེན་པོ་བྱུང་ངོ་། །
en: “The bodhisatva Samvara, Śāriputra, was the first to reach unsurpassed perfect awakening, and he appeared in the world as a tathāgata, arhat, fully accomplished buddha by the name of Uttaptavīrya. He was perfect in wisdom and conduct, he was a sugata, a knower of the world, an unsurpassable guide for those who wished to train, a teacher of gods and men, awakened, a lord. He remained for ninety million years and had a great following of ninety million trillion śrāvakas.

source: ཤཱ་རིའི་བུ་དེ་ལ་གང་བྱང་ཆུབ་སེམས་དཔའ་སྡོམ་པ་ལ་གནས་ཞེས་བྱ་བ་དེ་ནི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་འབར་བ་བྱང་ཆུབ་ཐོབ་པ་དེའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ཏེ དེས་དེ་བཞིན་གཤེགས་པ་དེ་དང་། དགེ་སློང་གི་དགེ་འདུན་དུ་བཅས་པ་ལ་ཟླ་བ་གསུམ་གྱི་བར་དུ་ན་བཟའ་དང་། བསོད་སྙོམས་དང་། མལ་སྟན་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བསྟི་སྟང་དུ་བྱས། བླ་མར་བྱས། རི་མོར་བྱས། མཆོད་པར་བྱས་སོ། །
en: “Śāriputra, when the Lord, the Tathāgata Uttaptavīrya reached awakening, the bodhisatva Samvarasthita became a king of the entire world, and for three months he honored, venerated, respected, and worshiped the Tathāgata, as well as his community of mendicants, with food, beds, seats, medicine for the sick, and utensils.

source: དེ་ནས་ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བརྩོན་འགྲུས་འབར་བ་དེས་རྒྱལ་པོ་དེ་འོངས་པར་མཁྱེན་ནས་ རྒྱལ་པོ་ལ་བསྐུལ་བའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: “Then, receiving the king, the Lord Uttaptavīrya, the tathāgata, the arhat, the fully accomplished Buddha, spoke these verses of encouragement to him:

source: སངས་རྒྱས་ཆོས་རྣམས་ཐོབ་པ་ལ། །བརྩོན་འགྲུས་དམ་པ་མཆོག་ཡིན་ཏེ། །
en: “ ‘Vigor is the best way, the most excellent way To attain the qualities of a buddha,

source: འདོད་ལ་བརྐམ་པའི་སེམས་ཅན་རྣམས། །སེམས་ཅན་དོན་བྱེད་ཤིན་ཏུ་དཀོན། །འདོད་ལ་བརྐམ་པའི་དོན་རྣམས་གང་། །དེ་ནི་མཁས་པའི་དོན་མ་ཡིན། །
en: But it is exceedingly rare to be able to work for the benefit of beings While living among sentient beings who are infatuated with desire. “ ‘When one is infatuated with desire, One is not interested in the way of the learned.

source: ཁྱོད་ནི་དོན་མེད་གནས་པ་སྟེ། །
en: If you are not interested in this,

source: མཆོག་གི་དོན་ཚོལ་མ་ཡིན། །
en: You will not attain the highest goal.

source: ང་ཉིད་དང་ནི་ཁྱོད་ཉིད་དུ། །སྔོན་ནི་སྤུན་དུ་གྱུར་པ་སྟེ། །རྫོགས་པའི་སངས་རྒྱས་མྱུར་གྲུབ་ཅེས། །དེ་ན་བདག་ཅག་དམ་བཅས་སོ། །
en: “ ‘You and I Were once siblings, And both of us vowed To quickly become fully awakened.

source: ངས་ནི་བྱང་ཆུབ་ཐོབ་གྱུར་ཏེ། །ཚངས་པའི་འཁོར་ལོ་བསྐོར་བ་ལྟོས། །ཁྱོད་ནི་ཁྱིམ་དང་ཆུང་མ་དག །རྟག་ཏུ་སྲུང་ཞིང་གནས་པ་ཡིན། །
en: “ ‘Look! I have now reached awakening And am setting the holy wheel in motion, While you have women and a household That you constantly have to look after.

source: མཁས་པ་རྣམས་ནི་འདི་ལ་ཡིད་མི་རྟོན། །
en: “ ‘The wise do not put their faith in such things.
